Revit 2027 API
StructuralAsset.PoissonRatio Property
 The Poisson ratio of the asset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ PoissonRatio { get; set; }
Public Property PoissonRatio As XYZ
	Get
	Set
public:
property XYZ^ PoissonRatio {
	XYZ^ get ();
	void set (XYZ^ value);
}
member PoissonRatio : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
InapplicableDataException |  When setting this property: the material type is wood. -or- When setting this property: the behavior is isotropic.
Remarks
 This property cannot be used to set the Poisson ratio for wood-based and isotropic materials. For such assets, use setPoissonRatio instead.
See Also
Reference
StructuralAsset Class
Autodesk.Revit.DB Namespace